In [1]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [38]:
df = pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [39]:
df.rename(columns = {'test_score(out of 10)':'test_score','interview_score(out of 10)':'interview_score','salary($)':'salary'},inplace = True)
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [40]:
df.experience.fillna('three',inplace=True)
df

  experience  test_score  interview_score  salary
0      three         8.0                9   50000
1      three         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [41]:
from word2number import w2n

df.experience = df.experience.apply(w2n.word_to_num)
df

   experience  test_score  interview_score  salary
0           3         8.0                9   50000
1           3         8.0                6   45000
2           5         6.0                7   60000
3           2        10.0               10   65000
4           7         9.0                6   70000
5           3         7.0               10   62000
6          10         NaN                7   72000
7          11         7.0                8   80000

In [29]:
df.test_score.fillna(df.test_score.median(),inplace=True)
df

  experience  test_score  interview_score  salary
0          3         8.0                9   50000
1          3         8.0                6   45000
2          5         6.0                7   60000
3          2        10.0               10   65000
4          7         9.0                6   70000
5          3         7.0               10   62000
6         10         8.0                7   72000
7         11         7.0                8   80000

In [32]:
reg = linear_model.LinearRegression()
reg.fit(df.drop(['salary'],axis='columns'),df.salary)

LinearRegression()

In [34]:
reg.predict([[2,9,6]])

array([47669.04741898])

In [35]:
reg.predict([[12,10,10]])

array([95355.60036972])